In [2]:
import pandas as pd
data = {
    'name':['张三','李四','王五','赵六'],
    'age':[18,17,19,20],
    'height':[168,179,172,165]
}
df = pd.DataFrame(data,columns=['name','age','height'])
df

  name  age  height
0   张三   18     168
1   李四   17     179
2   王五   19     172
3   赵六   20     165

In [3]:
df['name']

0    张三
1    李四
2    王五
3    赵六
Name: name, dtype: object

In [4]:
df.age

0    18
1    17
2    19
3    20
Name: age, dtype: int64

In [9]:
df[['name','age']]

  name  age
0   张三   18
1   李四   17
2   王五   19
3   赵六   20

In [13]:
name = df.name.copy()
name[0] = '听见'
name

0    听见
1    李四
2    王五
3    赵六
Name: name, dtype: object

In [14]:
df.columns

Index(['name', 'age', 'height'], dtype='object')

In [15]:
df.columns[1:3]

Index(['age', 'height'], dtype='object')

In [16]:
df[df.columns[1:3]]

   age  height
0   18     168
1   17     179
2   19     172
3   20     165

In [18]:
import datetime
df['Born'] = datetime.datetime.now().year-df.age
df

  name  age  height  year  Born
0   张三   18     168  2001  2001
1   李四   17     179  2002  2002
2   王五   19     172  2000  2000
3   赵六   20     165  1999  1999

In [19]:
df.drop('Born',axis=1)

  name  age  height  year
0   张三   18     168  2001
1   李四   17     179  2002
2   王五   19     172  2000
3   赵六   20     165  1999

In [20]:
df.drop(['height','year'],axis=1)

  name  age  Born
0   张三   18  2001
1   李四   17  2002
2   王五   19  2000
3   赵六   20  1999

In [21]:
df.drop(df.columns[1::2],axis=1)

  name  height  Born
0   张三     168  2001
1   李四     179  2002
2   王五     172  2000
3   赵六     165  1999

In [22]:
df.loc[1]

name        李四
age         17
height     179
year      2002
Born      2002
Name: 1, dtype: object

In [23]:
type(df.loc[1])

pandas.core.series.Series

In [24]:
df.loc[[1,3]]

  name  age  height  year  Born
1   李四   17     179  2002  2002
3   赵六   20     165  1999  1999

In [25]:
df.index[-2:]

RangeIndex(start=2, stop=4, step=1)

In [27]:
df.loc[df.index[-2:]]

  name  age  height  year  Born
2   王五   19     172  2000  2000
3   赵六   20     165  1999  1999

In [28]:
df.loc[df.index[-2:],['name','age']]

  name  age
2   王五   19
3   赵六   20

In [29]:
df.shape

(4, 5)

In [34]:
df

  name  age  height  year  Born
0   张三   18     168  2001  2001
1   李四   17     179  2002  2002
2   王五   19     172  2000  2000
3   赵六   20     165  1999  1999

In [35]:
df.loc[df.shape[0]] = {'name':'五九','age':21,'height':166,'year':0,'Born':0}
df

  name  age  height  year  Born
0   张三   18     168  2001  2001
1   李四   17     179  2002  2002
2   王五   19     172  2000  2000
3   赵六   20     165  1999  1999
4   五九   21     166     0     0

In [38]:
df2 = df.drop(2)
df2.index = range(0,4)

In [39]:
df2

  name  age  height  year  Born
0   张三   18     168  2001  2001
1   李四   17     179  2002  2002
2   赵六   20     165  1999  1999
3   五九   21     166     0     0

In [40]:
df2.iloc[2]

name        赵六
age         20
height     165
year      1999
Born      1999
Name: 2, dtype: object

In [41]:
df2.index = list('ABCD')
df2

  name  age  height  year  Born
A   张三   18     168  2001  2001
B   李四   17     179  2002  2002
C   赵六   20     165  1999  1999
D   五九   21     166     0     0

In [43]:
df2.iloc[1:3]

  name  age  height  year  Born
B   李四   17     179  2002  2002
C   赵六   20     165  1999  1999

In [44]:
df2.iat[1,1]

17

In [45]:
df2.iat[1,1] = 66

In [46]:
df2

  name  age  height  year  Born
A   张三   18     168  2001  2001
B   李四   66     179  2002  2002
C   赵六   20     165  1999  1999
D   五九   21     166     0     0

In [47]:
df['height'] >= 165

0    True
1    True
2    True
3    True
4    True
Name: height, dtype: bool

In [49]:
df[(df['height'] >= 165) & (df['age']<=20)]

  name  age  height  year  Born
0   张三   18     168  2001  2001
1   李四   17     179  2002  2002
2   王五   19     172  2000  2000
3   赵六   20     165  1999  1999

In [53]:
df.query('(height>=165 and age >=20)')

  name  age  height  year  Born
3   赵六   20     165  1999  1999
4   五九   21     166     0     0

In [55]:
age = 20
df.query('age <= 20')

  name  age  height  year  Born
0   张三   18     168  2001  2001
1   李四   17     179  2002  2002
2   王五   19     172  2000  2000
3   赵六   20     165  1999  1999

In [57]:
age = 20
df.query('age == @age')

  name  age  height  year  Born
3   赵六   20     165  1999  1999

In [58]:
df['age'].isin([18,19])

0     True
1    False
2     True
3    False
4    False
Name: age, dtype: bool

In [59]:
df[df['age'].isin([18,19])]

  name  age  height  year  Born
0   张三   18     168  2001  2001
2   王五   19     172  2000  2000

In [60]:
df.T

           0     1     2     3    4
name      张三    李四    王五    赵六   五九
age       18    17    19    20   21
height   168   179   172   165  166
year    2001  2002  2000  1999    0
Born    2001  2002  2000  1999    0